{"gtl15ae": {"body": "lol probably a GME cultist convinced every other play is hedgie manipulation", "sentiment": -1, "ticker": "GME"}, "gtl15jd": {"body": "CRWD and ROKU!??!!? 😡 \n\nYou’re shit.", "sentiment": 0, "ticker": "CRWD"}, "gtl16dw": {"body": "Bought QQQ puts at the top 🤫", "sentiment": -1, "ticker": "QQQ"}, "gtl16ef": {"body": "GME is probably the most odd. But there are at least 5 others that I'm in (and not allowed to mention in WSB because of their low cap) which are trading awkwardly sideways.\n\nGME volume makes no sense compared to what has been going on recently.\n\nThe other stocks I'm in that I was talking about are having HUGE increases in volume and virtually no change in price.", "sentiment": -1, "ticker": "GME"}, "gtl1716": {"body": "We need a NKLA thread 🙌💎 to the moon 🚀🚀🚀🚀🚀 do your DD, unbelievable company, great management 🚀🚀🙌💎💎 *insert Ape emoji x6*", "sentiment": 2, "ticker": "NKLA"}, "gtl17pb": {"body": "Bought DKNG calls at the top today 🤡", "sentiment": 2, "ticker": "DKNG"}, "gtl17xl": {"body": "All the ASO haters coming out just wait you 🤡🤡\n\nASO 35 EOD 🚀🚀", "sentiment": 2, "ticker": "ASO"}, "gtl1805": {"body": "TSLA talk to me, whats going on bb", "sentiment": 0, "ticker": "TSLA"}, "gtl18a4": {"body": "Call me whatever you want. Still holding these ASO 4/16 35c. Let’s see who has the last laugh.", "sentiment": 1, "ticker": "ASO"}, "gtl18di": {"body": "I woke up expecting BB to be in the red, and she did not disappoint me", "sentiment": 1, "ticker": "BB"}, "gtl18wx": {"body": "This is classic ASO movement. Bullish AF", "sentiment": 1, "ticker": "ASO"}, "gtl19c7": {"body": "thank you for your kind words. i do hope i will be able to do it, eventually too! \n\nunfortunately i am in the red, but i am currently trying to climb my way back up. hopefully my VIAC play pays off. and i agree, totally up for it. wna be a WSB Millionaire too bro 😂. but good luck in your future trading journey man, you are a good lad.", "sentiment": 1, "ticker": "VIAC"}, "gtl1a1u": {"body": "Good time to buy AMC?", "sentiment": 0, "ticker": "AMC"}, "gtl1b2f": {"body": "Getting in on the NIO dip", "sentiment": 1, "ticker": "NIO"}, "gtl1bdd": {"body": "Lmao the GME threads are fucking terrible. Bunch of kids with ten bucks circle jerking", "sentiment": -1, "ticker": "GME"}, "gtl1bz7": {"body": "Alexa, block the downvoters and start our GME moon playlist.\n\nhttps://www.youtube.com/watch?v=KF32DRg9opA", "sentiment": 1, "ticker": "GME"}, "gtl1cna": {"body": "A year ago this company was trading around 4 dollars, well on it's way to bankruptcy.\n\nNow, a year later, we've seen a semi-squeeze up to almost 500$, and have found a floor at first 40$ and now 180-190$.\n\nCan 🌈🐻  please try to convincingly twist this into something other than a SUPER FUCKING BULLISH trend?", "sentiment": 1, "ticker": "GME"}, "gtl1cr2": {"body": "I just woke up wtf is happening to TSLA?", "sentiment": 0, "ticker": "TSLA"}, "gtl1dxk": {"body": "How boring must the GME thread be now that it just trades sideways for 2 weeks", "sentiment": 0, "ticker": "GME"}, "gtl1e4p": {"body": "Not since the GME debacle. 14 year olds trying to feel like grown ups love this shit", "sentiment": -1, "ticker": "GME"}, "gtl1ese": {"body": "Can't wait to dump this RBLX bag and run.", "sentiment": -2, "ticker": "RBLX"}, "gtl1etc": {"body": "I sold my chpt calls to hop in VIAC chpt goes up and VIAC goes down wtf", "sentiment": -1, "ticker": "VIAC"}, "gtl1fui": {"body": "Where my $PLTR boys at? Just bought 5 more to cost avg down and fuel up for the moon!", "sentiment": 2, "ticker": "PLTR"}, "gtl1h3m": {"body": "Lol BA is worth 150b compared to AAPL 2.11T let that sink in. \n\nThere’s like 2 plane manufacturers and a thousand consumer electronics vendors as well as dozen or so phone manufacturers. LOL\n\nLong BA.", "sentiment": 1, "ticker": "BA"}, "gtl1haq": {"body": "You know what I did when I collected the premium? \n\nBought more GME shares!!!!", "sentiment": 1, "ticker": "GME"}, "gtl1hke": {"body": "Bruh is TSM just going to bleed until earnings or what?", "sentiment": -1, "ticker": "TSM"}, "gtl1ikx": {"body": "TSLA gonna have robotaxis on Mars by the time GM produces a EV hummer with EV tech from the 80’s", "sentiment": 1, "ticker": "TSLA"}, "gtl1iwj": {"body": "I'm shorting BAC ... good enough?", "sentiment": -1, "ticker": "BAC"}, "gtl1jqx": {"body": "Don’t let the people with partial shares tell you how to live your life.\n\nI’ve been collecting some weekly call money too. And been putting it right back into GME lol", "sentiment": 1, "ticker": "GME"}, "gtl1jye": {"body": "lmao my favorite part is that I've made more profit on GME in two months than he has in 2 years with over triple the portfolio size in BA and AUTL", "sentiment": 1, "ticker": "GME"}, "gtl1k8m": {"body": "I can't be the only one that thinks that SPY is Too Damn High!", "sentiment": -1, "ticker": "SPY"}, "gtl1kx7": {"body": "Didn't sell my RKT calls when it was up 1600%. At least it was just 1 contract...", "sentiment": -1, "ticker": "RKT"}, "gtl1lgm": {"body": "THIS FUCKIN BOOMER THINKS TSLA IS WORTH 150 LMAOOOOOOOOOOOOOO\n\n[https://www.cnbc.com/2021/04/06/tesla-tlsa-stock-is-overvalued-and-worth-150-says-analyst.html](https://www.cnbc.com/2021/04/06/tesla-tlsa-stock-is-overvalued-and-worth-150-says-analyst.html)\n\ndont let this distract you from the fact that tsla is still overvalued, but 150? cmon gtfo", "sentiment": 0, "ticker": "TSLA"}, "gtl1mi1": {"body": "The fact that people are making a pointed effort to tell me that GME is over tells me everything I need to know. Why in the FUCK do you care what we do with our money?", "sentiment": 1, "ticker": "GME"}, "gtl1mj3": {"body": "Maybe we should get AMC tattoos. We would have immortality and never die, even long after we should have expired.", "sentiment": 1, "ticker": "AMC"}, "gtl1nw8": {"body": "I really like GM. I have 3 calls, two for $70 on 6/18 and one for $62.5 on 4/16", "sentiment": 1, "ticker": "GM"}, "gtl1o0x": {"body": "Doubt it’s too late to hop back on CHPT.\nIt’ll probably bounce around the rest of the week.\n\nJust buy the dip, it’s a good stock", "sentiment": 1, "ticker": "CHPT"}, "gtl1o1y": {"body": "SHORT SQUEEZEL POTENTIAL: 💎NKLA💎 Smashing earnings! Great management! Possible TRIPLE gamma short squeeze 🚀🚀🚀🚀🚀 BUY THE DIP", "sentiment": 2, "ticker": "NKLA"}, "gtl1o7p": {"body": "SPY is at a 40 P/E?", "sentiment": -1, "ticker": "SPY"}, "gtl1o7t": {"body": "GME is becoming a boomer stock. Its so fucking boring", "sentiment": -1, "ticker": "GME"}, "gtl1ovz": {"body": "GME drops from 190 to 160\nCNBC in a matter of seconds: GameStop selling shares, it’s all over pack it up\n\nGME rebounding right back to 190 the very same day like nothing even happened\nCNBC: *crickets*", "sentiment": 1, "ticker": "CNBC"}, "gtl1ps1": {"body": "Probably the same guy who gave AMC a $13 pt.", "sentiment": 1, "ticker": "AMC"}, "gtl1q90": {"body": "people pay more because it's AAPL\n\nhardly surprising", "sentiment": -1, "ticker": "AAPL"}, "gtl1rwx": {"body": "Thanks man. I'm 100% in on GME but there is money to be made off the idiots buying weeklies", "sentiment": 1, "ticker": "GME"}, "gtl1s6x": {"body": "I think this thing just plateaus down from here into the low 100s. Haters will downvote this and say that I work for a hedge fund and blah blah blah. Nah, I have been a retail investor for 20 years with alpha on the S&P, and it's time to short GME:\n\nThe short thesis just isn't there anymore. Never mind the false narrative we all got sold that longs were \"fighting the hedgies\" (most hedge funds are now swing trading this with us in both directions) but in addition to the short interest being too low, and the new dilution, the volume is just not there.", "sentiment": -1, "ticker": "GME"}, "gtl1sn7": {"body": "Is PLTR dead for the foreseeable future? (at least 1 year). \n\nSeems nasdaq is headed close to ATH, and palantir is straggling around 22-23 with continuous good news, and demo day coming up. \n\nWondering if it's time to pull up my position at 25, bit the small loss and find something else.", "sentiment": -1, "ticker": "PLTR"}, "gtl1vuw": {"body": "Buying some EBON, down 30% last week.", "sentiment": 0, "ticker": "EBON"}, "gtl1wln": {"body": "alright why did DKNG go red? wtf, I get punched in the gut by APHA and now DKNG wants to turn this way?", "sentiment": -1, "ticker": "DKNG"}, "gtl1x81": {"body": "I should definitely sell KTOS on the morning pop", "sentiment": -1, "ticker": "KTOS"}, "gtl1yib": {"body": "The part where they shorted GME at $15 😂", "sentiment": 1, "ticker": "GME"}, "gtl20dz": {"body": "Worth keeping my VIAC leaps or too much risk of another shoe dropping?", "sentiment": 0, "ticker": "VIAC"}, "gtl217a": {"body": "Ya know, we could short squeeze EBON...", "sentiment": 1, "ticker": "EBON"}, "gtl21tn": {"body": "VLDR popping the fuck off today god damn. 🚀🚀🚀", "sentiment": 2, "ticker": "VLDR"}, "gtl222p": {"body": "My brother just got served a divorce. Thank God I'm holding GME.", "sentiment": 1, "ticker": "GME"}, "gtl226y": {"body": "DKNG I really need you to pop up now", "sentiment": 1, "ticker": "DKNG"}, "gtl22rk": {"body": "big thanks to the person who told me to buy $CHWY calls yesterday", "sentiment": 1, "ticker": "CHWY"}, "gtl237p": {"body": "Wait I’ve been out of the loop, what’s ASO and why I should I yolo into it?", "sentiment": 1, "ticker": "ASO"}, "gtl2469": {"body": "WSB has constant cycles coming and going for different stocks. PLTR, MSFT, RKT, TLRY, and TSLA  have all had their day in the sun. GME has been much bigger for much longer than any other. It is really unprecedented. But everyone should expect other tickers to come and go, that's the nature of this place. GME isn't a stock for weekly otm call foodstamps-or-lambos YOLOs.", "sentiment": 0, "ticker": "GME"}, "gtl24di": {"body": "Thank fuck March is over. Good to see TSLA is still rupturing my anus with its inability to pass 700.", "sentiment": -1, "ticker": "TSLA"}, "gtl24qe": {"body": "Add ASO", "sentiment": 1, "ticker": "ASO"}, "gtl254o": {"body": "Boomers looked at GME and thought they had learned something (finally) by way of Blockbuster.    \nHedgies thought they saw just another easy money short play.    \nCohen saw a bargain.      \nGamers?  Well gamers simply rose up.  \nCue 80's montage and music - YOU'RE THE BEST, AROUND!", "sentiment": 1, "ticker": "GME"}, "gtl25m6": {"body": "TSLA is fake and gay", "sentiment": -1, "ticker": "TSLA"}, "gtl263v": {"body": "PLTR has always been about the long term", "sentiment": 1, "ticker": "PLTR"}, "gtl279v": {"body": "Quick apes! Buy the NKLA dip. #NEW GME\n\nSmashing company 🥵🚀🚀💎 to the moon 🌝 SHORT SQUEEZE POTENTIAL + GAMMA SQUEEZE RADIOACTIVITY 😬🙌🙌", "sentiment": 1, "ticker": "NKLA"}, "gtl28f1": {"body": "WSB this morning: Buy ASO, it's gonna squeeze even higher\n\nWSB 1.5 hours later: oh no, I'm in danger", "sentiment": 1, "ticker": "ASO"}, "gtl28v3": {"body": "Hey guys, I paid $11k in taxes today out of pocket, BUT I SAVED $13K to pay my taxes so guess who has 10 more shares of GME!", "sentiment": 1, "ticker": "GME"}, "gtl2a0d": {"body": "MVIS about to bust upwards", "sentiment": 1, "ticker": "MVIS"}, "gtl2brz": {"body": "Hilarious irony\n\nSome RKT bagholder told me last week that GME holders are annoying and missing out on money. RKT dumped again the next day", "sentiment": -1, "ticker": "RKT"}, "gtl2cki": {"body": "This is by far the most annoying price action on SPY I've ever seen, just dump it already.", "sentiment": -1, "ticker": "SPY"}, "gtl2d3c": {"body": "\"My weiner is rock hard for GME.\" - George Washington", "sentiment": 1, "ticker": "GME"}, "gtl2d7o": {"body": "Yes, I believe GME is beyond technical analysis.  🧐", "sentiment": 1, "ticker": "GME"}, "gtl2ezo": {"body": "Being a RKT bagholder is like a rite of passage for WSB users now", "sentiment": -1, "ticker": "RKT"}, "gtl2f4j": {"body": "Heck yeah, I joined the TLRY party today, let's hold long and strong !", "sentiment": 1, "ticker": "TLRY"}, "gtl2fbz": {"body": "I mean, I'm holding GME, PLTR but I ain't bitching. I'm just enjoying the ride. Plus I'm retarded so 🤷‍♂️", "sentiment": 1, "ticker": "GME"}, "gtl2fuj": {"body": "I sold all that shit already for GME because none of them were doing anything other than sideways or down", "sentiment": 1, "ticker": "GME"}, "gtl2g7a": {"body": "ASO at nearly the same volume as yesterday and had been pinned at 31 for an hour and a half. Something fishy 🎣🎣🎣", "sentiment": 0, "ticker": "ASO"}, "gtl2g8k": {"body": "AIV. Undervalued company been steadily rising back up every day/week/month get in before it's too late 🥳", "sentiment": 1, "ticker": "AIV"}, "gtl2gol": {"body": "Fuck BABA I am so fucking hard right now", "sentiment": 2, "ticker": "BABA"}, "gtl2gpn": {"body": "If there is anything good in the news about APHA, it nosedives .....got me twice like that, wont be a third time....", "sentiment": -1, "ticker": "APHA"}, "gtl2gqq": {"body": "Ok RKT break them chains", "sentiment": 1, "ticker": "RKT"}, "gtl2i7h": {"body": "Here we go again with the random speculative analysis on GME. No one really knows what's gonna happen as of now. I'm still holding 🧘‍♂️", "sentiment": 0, "ticker": "GME"}, "gtl2ic5": {"body": "ohhhh when i said \"shit like\" it was figure of speech man.\n\ni have like 40k in CRWD calls. i prefer it to go back to 200+ asap. heh.\n\nhad 60k+ but i trimmed my position today on my 200c. still holding 220c.", "sentiment": 1, "ticker": "CRWD"}, "gtl2ist": {"body": "UTME up over 500% and been halted a itjtbthdisinervdhhreillion times", "sentiment": 1, "ticker": "UTME"}, "gtl2j8v": {"body": "Congrats RMO crowd!", "sentiment": 1, "ticker": "RMO"}, "gtl2jmb": {"body": "U should average down if u can. I was at avg 270 but managed to get down to 230", "sentiment": 0, "ticker": "GME"}, "gtl2k4n": {"body": "TSLA iS bEiNg LaddER aTtACkEd!", "sentiment": -1, "ticker": "TSLA"}, "gtl2k87": {"body": "All I play is SPY these days.", "sentiment": 1, "ticker": "SPY"}, "gtl2km1": {"body": "Glad I sold my MARA and RIOT at pre market.", "sentiment": -1, "ticker": "MARA"}, "gtl2kt9": {"body": "I love how the daily thread the same people telling you GME is worthless are the same people complaining about holding PLTR/NOK/BB bags", "sentiment": -1, "ticker": "GME"}, "gtl2l0t": {"body": "PTON quick short DD. From June 30 2020 three months end to Sep 30 2020 three months end, total workouts competed was essentially flat. Flat growth likely due to people going outside and covid deceleration. However, nice 26% growth in total workouts for dec 30 2021 three months end. Will also see baller growth for Mar 30 2021 three months end, New Years resolutions and stuff like that. \n\nHowever, market is forward looking. I think guidance for Jun 30 three months end is going to be WEAK due to decreasing covid, people going outside, etc.. of course subs and all that are important, but engagement in the form of workouts completed is more important, imo. If engagement falls, which I think it will, then it’ll lead to lower subs. Guess we will see. \n\nPTON 09/21 70p", "sentiment": -1, "ticker": "PTON"}, "gtl2n1h": {"body": "ASO being pinned to exactly $31 by both longs and shorts is rather interesting.", "sentiment": 0, "ticker": "ASO"}, "gtl2n96": {"body": "I told the apes to buy NKLA 😂 they got mad. It’s their kinda stock lmao", "sentiment": 1, "ticker": "NKLA"}, "gtl2nip": {"body": "Stagnant GME equals more pain for HEDGIES. they are drowning in interest right now. APES keep your bananas.", "sentiment": 1, "ticker": "GME"}, "gtl2pn3": {"body": "Can we make SNDL happen again ;(", "sentiment": 0, "ticker": "SNDL"}, "gtl2r22": {"body": "Pros of GME Finally Mooning\n•No more getting edged by sideways trading\n•Fuck my day job\n•Lambos, tendies, blackjack, and hookers\n\nCons of GME Finally Mooning\n•No more lit ape megathreads 🥺", "sentiment": 1, "ticker": "GME"}, "gtl2ror": {"body": "VLRS keep doing your thing baby. I might purchase a flight to Mexico and then the moon", "sentiment": 1, "ticker": "VLRS"}, "gtl2sc4": {"body": "I mean SPY calls are literally free money at this point.", "sentiment": 1, "ticker": "SPY"}, "gtl2su9": {"body": "CHEWY CAN HELP BUCK THE BUNNY .... 😏", "sentiment": 1, "ticker": "CHWY"}, "gtl2t3q": {"body": "PINS you POS! Fall now! Enough going up 😒😒😒", "sentiment": -1, "ticker": "PINS"}, "gtl2t47": {"body": "SNDL is FETCH", "sentiment": 1, "ticker": "SNDL"}, "gtl2t6j": {"body": "$VIAC and $DISCA got that drip today", "sentiment": 1, "ticker": "VIAC"}, "gtl2tlg": {"body": "CRSR up for the last few days, I expect a downward trend for the next 2 weeks to level it out.", "sentiment": -1, "ticker": "CRSR"}, "gtl2usk": {"body": "GME people think MMs are preventing David Bowie's next studio album.", "sentiment": -1, "ticker": "GME"}, "gtl2uy0": {"body": "MRNA 🚀🚀🚀", "sentiment": 1, "ticker": "MRNA"}, "gtl2vle": {"body": "Don’t be fooled! The Hedgies have been short RKO 360° attacking NKLA for months!! Promising future", "sentiment": 1, "ticker": "NKLA"}, "gtl2yjk": {"body": "Anyone in CHWY? Picked some up, they did there drop thing after killer earnings, typically it’ll run back up. Seems good", "sentiment": 1, "ticker": "CHWY"}, "gtl2ysl": {"body": "Whoa ASO is in the red !?!?! 😨🤯😱\n\nWho could've seen that coming? /s", "sentiment": -1, "ticker": "ASO"}, "gtl2zsh": {"body": "i've seen house plants and dead people make more movement than ASO has in the last hour", "sentiment": -1, "ticker": "ASO"}, "gtl31r6": {"body": "Boomer stocks will creep up slow and steady. GME is like watching a geyser. Nothing for a while and then it blows.  Shorts are like the guys who climb in.  They might be able to hang on for a while but they will eventually get burned.", "sentiment": 1, "ticker": "GME"}, "gtl32ds": {"body": "VOO To 380 by 16th plz", "sentiment": 1, "ticker": "VOO"}, "gtl32gx": {"body": "ASO $25 is not a meme", "sentiment": 1, "ticker": "ASO"}, "gtl33jg": {"body": "imagine being a pussy and selling ASO today", "sentiment": 1, "ticker": "ASO"}, "gtl33lu": {"body": "Go RAIL go.", "sentiment": 1, "ticker": "RAIL"}, "gtl33xm": {"body": "I mean wall street articles are literally saying that.\n\nI do actually understand what PLTR does. But I am also in that line of work. It is possible wall street stops becoming dumb this year, but I doubt it. It took amazon years with AWS, and I am still not sure wall street understands what they do, but it makes lots of money so they are happy now.\n\nPLTR will be for the 90% of companies that just want their BI and analytics to work, and have lots of money, but haven't figured out how to build out an analytics team. They are essentially apple, while splunk, snowflake, datadog, and aws services are like early android. \n\nMy only worry right now is getting my shares called away and be chasing price with CSP.", "sentiment": 1, "ticker": "PLTR"}, "gtl34cj": {"body": "NOK is not a terrible bag to be holding, what with the nationwide 5G deal and all.", "sentiment": 1, "ticker": "NOK"}, "gtl34ed": {"body": "It’s hilarious how many Aspie GME AMC bagholding psychos are downvoting this to suppress it. This has real fundamentals and the shorts are going to have to start exiting soon, based on the real value of the company, not meme speculation of a bunch bedwetters trying to climb back in mommy’s womb via nostalgically buying a stock of a failing company from their childhood.", "sentiment": -2, "ticker": "GME"}, "gtl35cj": {"body": "What’s up with $RMO? 🚀🚀", "sentiment": 1, "ticker": "RMO"}, "gtl366q": {"body": "UTME gang", "sentiment": 1, "ticker": "UTME"}, "gtl3987": {"body": "I’m amazed I managed to get 15 shares of UTME in and it didn’t crash", "sentiment": 0, "ticker": "UTME"}, "gtl3ahn": {"body": "Butterfly spreads for RKT as a retirement plan is not a meme", "sentiment": 1, "ticker": "RKT"}, "gtl3auf": {"body": "Let’s go CHPT!", "sentiment": 1, "ticker": "CHPT"}, "gtl3ci4": {"body": "C'mon ASO, do something. Stick.jpeg", "sentiment": 0, "ticker": "ASO"}, "gtl3cip": {"body": "BUY GM! ITS GOING TO $70 BY JUNE!", "sentiment": 1, "ticker": "GM"}, "gtl3cng": {"body": "I'm also long BA.  But one is losing money while the other is raining dollars.  That said, BA to 270, please.", "sentiment": 1, "ticker": "BA"}, "gtl3d7x": {"body": "breakout at 9:45am PCT, $200 let's go!", "sentiment": 1, "ticker": "PCT"}, "gtl3dl3": {"body": "I haven't sold any shares. Just contracts. \n\nAny brother or sister buying weekly calls aren't in it for the same reasons. I believe in GME which is why I have 75k (95% of my networth) in shares. Weekly buyers are just trying to get rich quick off a lottery ticket. \n\nGo back in my history you'll see me talking about GME back in October. \n\nWe need to be patient and I'll make a few bucks off the impatient. \n\nMuch love brother", "sentiment": 1, "ticker": "GME"}, "gtl3emg": {"body": "Where’s the cunt that got me to buy into UWMC. He Straight up deleted all his DD", "sentiment": -1, "ticker": "UWMC"}, "gtl3g62": {"body": "Aw hamburgers, every time my AMD calls go positive i try to sell and nobody buys them", "sentiment": -1, "ticker": "AMD"}, "gtl3htp": {"body": "Volume on $SNAP April calls al the way up to $75 has been fucking huge, and was phot even during the tech turmoil days the last couple weeks.\n\nIs there some open rumor that I am the only one who doesn't know? I", "sentiment": 1, "ticker": "SNAP"}, "gtl3hxk": {"body": "SPY $420 by 4/20 IS NOT A MEME", "sentiment": 1, "ticker": "SPY"}, "gtl3iwj": {"body": "Thoughts on $TSM? Seems like the most solid semiconductor play for this year.", "sentiment": 0, "ticker": "TSM"}, "gtl3j3z": {"body": "AMD shareholders meeting tomorrow?", "sentiment": 0, "ticker": "AMD"}, "gtl3jgp": {"body": "If GME hits $205 by EOD I’ll get married to my fiancé next week.", "sentiment": 1, "ticker": "GME"}, "gtl3kmd": {"body": "People don't have an appetite for shorting GME given that it keeps rebounding back to $180+", "sentiment": 1, "ticker": "GME"}, "gtl3ll4": {"body": "Looks like ASO might be a long term play for me. same with RKT, PLTR and every play i buy at peak.", "sentiment": 1, "ticker": "ASO"}, "gtl3n9x": {"body": "Looks like I'm buying more ASO to account for the paper handed fucks that sold 2 hours after buying lol", "sentiment": 1, "ticker": "ASO"}, "gtl3q40": {"body": "WSB this morning: Buy ASO, it's gonna keep going higher\n\nWSB 1.5 hours later: oh no, I'm in danger", "sentiment": -1, "ticker": "ASO"}, "gtl3qeq": {"body": "Any thoughts on Digital Ocean (DOCN)?  It's cloud platform company that just IPOed.", "sentiment": 0, "ticker": "DOCN"}, "gtl3rd8": {"body": "Very bullish on ABNB. Plenty more momentum to run", "sentiment": 1, "ticker": "ABNB"}, "gtl3u3e": {"body": "If GME hits $300 EOD I'mma buy myself some big fake titties.\n\nI'm a dude.", "sentiment": 0, "ticker": "GME"}, "gtl3um6": {"body": " Can’t tell whats a bigger piece of trash, me or PLTR.", "sentiment": -1, "ticker": "PLTR"}, "gtl3v98": {"body": "Right. And to think that GME will create a new generation of level headed buy and hold investors out of a bunch of retards that used to blow their accounts weekly.", "sentiment": -1, "ticker": "GME"}, "gtl3vuy": {"body": "If you look on the 3 month 15 minute interval chart and zoom out you can see some very bullish pendants (triangles) forming. This is good for those wanting to squeeze GME. Add that to the heightened short interest yesterday this is going in our favour. The chart suggest a few more days of sideways trading before an upward trajectory can be made trading between 200 and 2012. Anyway I just made all of that up. Go and more more GME so the chart can do something.", "sentiment": -1, "ticker": "GME"}, "gtl3xh7": {"body": "GM is a machine", "sentiment": 1, "ticker": "GM"}, "gtl3y9a": {"body": "CHPT just carrying the team today for me.", "sentiment": 1, "ticker": "CHPT"}, "gtl3yar": {"body": "Holy shit is UTME ever gonna unhalt", "sentiment": -1, "ticker": "UTME"}, "gtl3yl4": {"body": "PLTR is an actual real stock, come on now.", "sentiment": 1, "ticker": "PLTR"}, "gtl3yta": {"body": "Come on SPY, do the thing", "sentiment": 0, "ticker": "SPY"}, "gtl3zmw": {"body": "BUY GM!!!", "sentiment": 1, "ticker": "GM"}, "gtl406v": {"body": "You might catch him counting his gains after telling the sub to buy ASO yesterday", "sentiment": 1, "ticker": "ASO"}, "gtl41kk": {"body": "\"Buying GME shares is just like shooting a red coat.  I orgasm every time.\" - George Washington", "sentiment": 1, "ticker": "GME"}, "gtl429a": {"body": "NOK ever going to run here? Strong fundamentals... but why not running yet? Manipulation?", "sentiment": 1, "ticker": "NOK"}, "gtl444s": {"body": "Ahahhaahahhahahaha.\n\nI'm an actual WSBer and I wrote a bear thesis on GME and it got downvoted to hell. This to me speaks of the absurdity of all this. I have made money as a long too, but to not even entertain why the short squeeze narrative is over is childish/deluded. People in this group act like everyone in the group is their friend, even though it's all one giant exercise and case study of the greater fool theory.", "sentiment": -1, "ticker": "GME"}, "gtl4490": {"body": "So does GME selling off more stock effect the moon plan?", "sentiment": -1, "ticker": "GME"}, "gtl44ci": {"body": "TLRY seems like it got hammered. Good time for calls?", "sentiment": 1, "ticker": "TLRY"}, "gtl45sr": {"body": "CARR has been printing. The most recent stimulus earmarked $130 billion for schools and companies to help improve air filtration and ventilation. HVAC gang 😎", "sentiment": 1, "ticker": "CARR"}, "gtl45xq": {"body": "COUR, CHPT and GM are putting me on the moon today", "sentiment": 1, "ticker": "CHPT"}, "gtl46et": {"body": "Some of us know the pain of paying rent or a mortgage every month (except good apes in parents basement). Now imagine if that check was millions/billions...well that's what the hedgies are paying every month so long as GME is in business. Get fucked Gabe and Kenny, my great-grandkids will be buying PSXXIVs and XBox Series XLVs from GME in the year 2120.", "sentiment": 1, "ticker": "GME"}, "gtl46ni": {"body": "PLTR has brought me and my family nothing but shame and dishonor.", "sentiment": -1, "ticker": "PLTR"}, "gtl46uo": {"body": "I sold all other positions. It's just GME & TLSS for the foreseeable future. 🚀🚀🚀🚀", "sentiment": 1, "ticker": "GME"}, "gtl478p": {"body": "BB could cure cancer and invent inter-dimensional travel and only +0.3%", "sentiment": -1, "ticker": "BB"}, "gtlj7on": {"body": "BBY testing those $120s highs. Likely to pull back after today.", "sentiment": -1, "ticker": "BBY"}, "gtlj8ib": {"body": "Been holding a LOUIS VUTTON bag of APHA shares (500 @28.30).\n\nOne of the few mistakes I have made along the way..🥶🥶🥶", "sentiment": -1, "ticker": "APHA"}, "gtlj8xu": {"body": "APHA upcoming early next week, on the 12th I believe.", "sentiment": 0, "ticker": "APHA"}, "gtlj9n4": {"body": "VIAC gonna hit 50 this week?", "sentiment": 0, "ticker": "VIAC"}, "gtljalb": {"body": "HL\n\nFree stock for joining RH. It’s actually doing pretty good.", "sentiment": 1, "ticker": "HL"}, "gtljctt": {"body": "Should've bought more GOEV yesterday", "sentiment": 1, "ticker": "GOEV"}, "gtljdag": {"body": "Just ordered a Midnight Express. In expectation of GME going to $69,420 on 4/20", "sentiment": 1, "ticker": "GME"}, "gtljdke": {"body": "Upped my stake in DFEN to 100 shares so I can sell some CCs on green days.", "sentiment": 1, "ticker": "DFEN"}, "gtljebj": {"body": "XL will be in the mid teens by summer", "sentiment": 1, "ticker": "XL"}, "gtljeh2": {"body": "Shit ROKU still pumping", "sentiment": 2, "ticker": "ROKU"}, "gtljh0n": {"body": "Anybody playing SNOW? Window shopping some 250c weeklies", "sentiment": 1, "ticker": "SNOW"}, "gtljhu2": {"body": "RMO was absolutely decimated by its miserable earnings just a few days ago. I hope y’all that jumped in get in and out quick to get that bump. \n\n\nLook at that fucking chart lmao. Don’t get caught with the bag, or you’ll be carrying it till you die ☠️", "sentiment": -1, "ticker": "RMO"}, "gtljhxn": {"body": "RBLX puts free money?", "sentiment": -1, "ticker": "RBLX"}, "gtljijc": {"body": "Idk gotta DD on it? \n\nSpy’s the only stock I trade honestly", "sentiment": 1, "ticker": "SPY"}, "gtljiju": {"body": "Yeah you retard, it is. So you're telling me you enjoy seeing this as opposed to a fucking sky rocket GME going to the moon?\nDown vote this ape already. Get out of our crib.", "sentiment": 1, "ticker": "GME"}, "gtljj7d": {"body": "Any PLUG bags from January?", "sentiment": -1, "ticker": "PLUG"}, "gtljkhr": {"body": "VIAC was supposed to go under $40 so i could buy. rip.", "sentiment": 1, "ticker": "VIAC"}, "gtljlx6": {"body": "It’s the year 2189 and PLTR is still within the 20$ ranges", "sentiment": -1, "ticker": "PLTR"}, "gtljn5j": {"body": "WYNN is saving me..thank you Vegas", "sentiment": 1, "ticker": "WYNN"}, "gtljop6": {"body": "if you bought 5000 worth of AAPL  6 months ago you'd have 5080 dollars today", "sentiment": 0, "ticker": "AAPL"}, "gtljost": {"body": "The worst part is, I was holding SPY $400 Calls until 3/26", "sentiment": 1, "ticker": "SPY"}, "gtljps8": {"body": "TSLA why must you frustrate me so? You go on such a beautiful run and then crash and burn like the piece of shit you are. \n\nI still love you just give me my money back.", "sentiment": -1, "ticker": "TSLA"}, "gtljqft": {"body": "RMO IS KILLING IT. I only made $100 on a $70 call... coulda made $1400 buy paper hands...", "sentiment": 2, "ticker": "RMO"}, "gtljsji": {"body": "UWMC and OCGN fuck me", "sentiment": -1, "ticker": "UWMC"}, "gtljtr8": {"body": "I’ve been holding APHA 21MAY21 20c  just in anticipation of 4/20. Not only are they merging with Tilray making them the largest worldwide cannabis company- both of them are solid af. This shit is gonna PRINT.", "sentiment": 2, "ticker": "APHA"}, "gtljvuj": {"body": "Buy NOK calls!", "sentiment": 1, "ticker": "NOK"}, "gtljwi9": {"body": "RMO puts? Hmmmmm", "sentiment": -1, "ticker": "RMO"}, "gtljyie": {"body": "Imagine a world where you are not in VIAC right now. \n\nCrazy heh?", "sentiment": 1, "ticker": "VIAC"}, "gtlk0o7": {"body": "GME to the fucking moon hedgies.", "sentiment": 1, "ticker": "GME"}, "gtlk121": {"body": "I’ve been thumping ASO for months", "sentiment": 1, "ticker": "ASO"}, "gtlk180": {"body": "POTX. Kinda shocked it's below $16/share. Buying.", "sentiment": 1, "ticker": "POTX"}, "gtlk1sr": {"body": "CCIV 24c super cheap. 😅", "sentiment": 1, "ticker": "CCIV"}, "gtlk2jb": {"body": "So what do we think? Is now the time to throw myself headlong into APHA calls for earnings? Or is it gonna bleed even further?", "sentiment": 0, "ticker": "APHA"}, "gtlk4mz": {"body": "Anyone pick up RMO 4/16 puts? Been seeing a lot of 2-way talk on this company", "sentiment": -1, "ticker": "RMO"}, "gtlk4tt": {"body": "Najarian sub pumping MLCO", "sentiment": 1, "ticker": "MLCO"}, "gtlk585": {"body": "Banks have finished unloading VIAC positions. Bottom reached, LETS RIDE!!!!", "sentiment": 1, "ticker": "VIAC"}, "gtlk5lh": {"body": "<——-    Hollars BB into this empty wsb cave looking for an echo. Where’s the BB gang today?", "sentiment": 1, "ticker": "BB"}, "gtlk6nj": {"body": "Quick! What strike on RMO puts?!", "sentiment": -1, "ticker": "RMO"}, "gtlk6wg": {"body": "Interested in some VIAC calls, what’s a good expiry date on something like this?", "sentiment": 1, "ticker": "VIAC"}, "gtlk7la": {"body": "ASO, riding below its VWAP with high SI and HV and low IV; good fundamentals to boot--what's not to like?", "sentiment": 1, "ticker": "ASO"}, "gtlk7ti": {"body": "Got some TSM", "sentiment": 1, "ticker": "TSM"}, "gtlkbls": {"body": "Ohhh don’t play with my heart like this VIAC.", "sentiment": -1, "ticker": "VIAC"}, "gtlkc0d": {"body": "Gonna be a lot of RMO bagholders", "sentiment": -1, "ticker": "RMO"}, "gtlkcwu": {"body": "I like RKT🚀 it’s going up! Feed me yummy downvotes but please be aware that it pleases me sexually 🚀🚀🚀🚀", "sentiment": 1, "ticker": "RKT"}, "gtlkf5m": {"body": "RMO puts anyone? 🤔🤔🤔", "sentiment": -1, "ticker": "RMO"}, "gtlkf6o": {"body": "Made a quick $50 on $PENN calls", "sentiment": 1, "ticker": "PENN"}, "gtlkgyr": {"body": "Hey mom can you buy some GME for me? I have ran out of money buying GME and I need more GME", "sentiment": 1, "ticker": "GME"}, "gtlkh17": {"body": "Wish I bought more CCIV on the dip in March . FOMO for days", "sentiment": 1, "ticker": "CCIV"}, "gtlkhai": {"body": "RMO is great for puts. Always goes down down down", "sentiment": -1, "ticker": "RMO"}, "gtlkhfc": {"body": "These calls are not enough time for a boomer stock like VIAC. Boomers move in quarterly earnings cycles, so need at least may calls. I got 20 June $50 calls. \n\nRoll these out to longer time frame my friend.", "sentiment": 1, "ticker": "VIAC"}, "gtlki3m": {"body": "Are we still feelin good about this month for APHA? This bag is getting heavier but im about to add a few more bricks to it with this dip", "sentiment": 0, "ticker": "APHA"}, "gtlkk4r": {"body": "[99.5% of UWMC holders are bagholding....](https://ibb.co/rkSq5Qb)", "sentiment": -1, "ticker": "UWMC"}, "gtlkkzg": {"body": "That RMO volume, could break $13 soon", "sentiment": 1, "ticker": "RMO"}, "gtlkpcu": {"body": "Dude just stop mentioning it. Its a horrible stock. All your doing is farming negative karma. Just dump your losses and get something that makes money. I can literally give you off hand 10 tickers that in a year will give you solid cash and shit NOK will be the same price. Do me an honest favor. Go to the NOK chart and zoom out 1 year. Yup utter disappointment.", "sentiment": -2, "ticker": "NOK"}, "gtlkr6z": {"body": "Yup fuck OCGN. They better cure blindness or something because I don’t think America is bringing in any new vaccines", "sentiment": -1, "ticker": "OCGN"}, "gtlkrj5": {"body": "20K in ARKK shares back up to 50% gains, thanks Cathie.", "sentiment": 1, "ticker": "ARKK"}, "gtlksbo": {"body": "CCIV 🚀", "sentiment": 1, "ticker": "CCIV"}, "gtlksdf": {"body": "You don't need any TA to let you know that WMT is poised to move up, it's been lagging so hard behind TGT", "sentiment": 1, "ticker": "WMT"}, "gtlky1o": {"body": "Is RIDE gonna start making a comeback now? Good time to buy calls?", "sentiment": 0, "ticker": "RIDE"}, "gtlkydo": {"body": "AMC green by close, book it", "sentiment": 1, "ticker": "AMC"}, "gtlkysn": {"body": "GME has an 8.1 bullish score on fidelity!", "sentiment": 1, "ticker": "GME"}, "gtlkzkp": {"body": "Imagine everyone who's sitting in the $GME thread watching it go sideways and down....and not making any money on the thousands of other stocks that are skyrocketing this week.", "sentiment": -1, "ticker": "GME"}, "gtll31w": {"body": "GME is a great money maker for theta gang right now.", "sentiment": 0, "ticker": "GME"}, "gtll4rs": {"body": "I really like JD got in at 30! Body has some sexy upside potential but I'm not sure I'm brave enough haha\n\nI think the whole Ma thing spooked investors with baba  disproportionately", "sentiment": 1, "ticker": "JD"}, "gtll71r": {"body": "Is RMO puts the move??? Or is it just gonna moon cause of EV hype??", "sentiment": -1, "ticker": "RMO"}, "gtll8bp": {"body": "All those swings and TSLA gonna finnish flat", "sentiment": 0, "ticker": "TSLA"}, "gtll8h7": {"body": "$ACY might take another run.", "sentiment": 1, "ticker": "ACY"}, "gtll9yi": {"body": "GME Green", "sentiment": 1, "ticker": "GME"}, "gtlla0k": {"body": "grats if you made out good on RMO but if you're still in:\n\nremember, every ramp has a slide.\n\nbuying puts", "sentiment": -1, "ticker": "RMO"}, "gtllal9": {"body": "RMO feeling heavier and is at that point where too many casuals know about it the first movers ready to take their profits and run, leaving a bunch of bag holders above $12\n\nI'll buy puts before market close", "sentiment": -1, "ticker": "RMO"}, "gtllbif": {"body": "I'm buying puts on $SPY.   \n\n\nJpow speaking tomorrow...regardless of anything, just the fact it's on a schedule, means market will be shaky.", "sentiment": -1, "ticker": "SPY"}, "gtllbmn": {"body": "How dead is MARA and should I buy puts?", "sentiment": -1, "ticker": "MARA"}, "gtlldck": {"body": "Calls on TLRY for 4/16", "sentiment": 1, "ticker": "TLRY"}, "gtlldsh": {"body": "ASO had a similar dip the week after their Q3 earnings (back in December). Then it got back on track and kept chugging.", "sentiment": 1, "ticker": "ASO"}, "gtlldwx": {"body": "I’m going long calls and shares on MVIS.", "sentiment": 1, "ticker": "MVIS"}, "gtllr3d": {"body": "Another day another flat GME day I'm getting bored", "sentiment": 0, "ticker": "GME"}, "gtllu2n": {"body": "VIAC GANG 🚀", "sentiment": 1, "ticker": "VIAC"}, "gtllw3o": {"body": "Weekly HYLN calls gained me 260% today. God bless EV full retard strength", "sentiment": 1, "ticker": "HYLN"}, "gtllw6u": {"body": "RMO puts for quick day trade don’t look bad 😇", "sentiment": -1, "ticker": "RMO"}, "gtllx4w": {"body": "Wow the random RMO 10c I bought is up 3650%.... is this real?", "sentiment": 1, "ticker": "RMO"}, "gtllyar": {"body": "TSLA Took it’s viagra finally 😳", "sentiment": 1, "ticker": "TSLA"}, "gtllz6v": {"body": "Look at PLUG pretending not to be a piece of shit!", "sentiment": -1, "ticker": "PLUG"}, "gtllzjz": {"body": "The CLF chart looks like someone dropped a ball.", "sentiment": -1, "ticker": "CLF"}, "gtlm034": {"body": "$OPTT at a massive discount rn", "sentiment": 1, "ticker": "OPTT"}, "gtlm0rp": {"body": "MCD puts look like free money here", "sentiment": -1, "ticker": "MCD"}, "gtlm0xq": {"body": "Buy some more GME", "sentiment": 1, "ticker": "GME"}, "gtlm112": {"body": "Are SeaWorld (SEAS) puts free money right now?", "sentiment": -1, "ticker": "SEAS"}, "gtlm1kg": {"body": "Thoughts on SNDL?", "sentiment": 0, "ticker": "SNDL"}, "gtlm235": {"body": "My BABA is poppin. My BABA is cool.", "sentiment": 1, "ticker": "BABA"}, "gtlm3ke": {"body": "$AMC BABY!!!", "sentiment": 1, "ticker": "AMC"}, "gtlm5vz": {"body": "Sorry... GME to the Moon 🦍🦍🦍💎💎💎🦍⬆️🚀🚀🚀🚀", "sentiment": 1, "ticker": "GME"}, "gtlm8bo": {"body": "GME gone fly whether it be today tomorrow or next week or the one after that 😎🚀🚀🚀🚀", "sentiment": 1, "ticker": "GME"}, "gtlm984": {"body": "6/18 AAPL 145c’s gonna print?", "sentiment": 0, "ticker": "AAPL"}, "gtlmb9y": {"body": "I fucking hate RMO.\n\nI sold my $10c's for basically nothing yesterday.\n\nI am going to buy puts on this dumbass battery maker that doesnt even know how to get the raw materials to make batteries", "sentiment": -2, "ticker": "RMO"}, "gtlmbsk": {"body": " I once saw a petrified eagle in a dry desert. The eagle had a snake inside of it from ages past. Inside the snake was actually a corpse of a mouse. I never thought I'd ever see anything more dead than that rat until GME stock this week", "sentiment": -1, "ticker": "GME"}, "gtlmeie": {"body": "What's up with FSR did they cure covid cancer?", "sentiment": 0, "ticker": "FSR"}, "gtlmeoj": {"body": "Should I get back in FUBO? 🤔", "sentiment": 0, "ticker": "FUBO"}, "gtlmfkm": {"body": "no one knows about VZIO, but shes my main HOE", "sentiment": 1, "ticker": "VZIO"}, "gtlmftc": {"body": "Puts on RMO? 👀", "sentiment": -1, "ticker": "RMO"}, "gtlmj2d": {"body": "RMO is breaking 13 before eod", "sentiment": 1, "ticker": "RMO"}, "gtlmn0f": {"body": "has anyone looked into $QELL? worth throwing a dart at it?", "sentiment": 0, "ticker": "QELL"}, "gtlmn1s": {"body": "It’s just a matter of time until SPY succumbs to the power of the 🌈🐻 😈", "sentiment": -1, "ticker": "SPY"}, "gtlmskt": {"body": "TSLA is gonna shoot up 2% randomly before close", "sentiment": 1, "ticker": "TSLA"}, "gtlmtlo": {"body": "Damn nice call to whoever posted a few minutes ago that CCIV 24C are cheap. Congrats", "sentiment": 1, "ticker": "CCIV"}, "gtlmtvh": {"body": "If you don't buy DKNG then F you", "sentiment": 1, "ticker": "DKNG"}, "gtlmtyv": {"body": "Who da fuk is buying NKLA?", "sentiment": -1, "ticker": "NKLA"}, "gtlmwgq": {"body": "Pretty happy I missed the ASO hype. Gotta love the new bag holders every bubble gives us.", "sentiment": -1, "ticker": "ASO"}, "gtlmwpq": {"body": "Retars, pls start selling RMO, i loved you all and donw wanna see you losing money", "sentiment": -1, "ticker": "RMO"}, "gtlmwv0": {"body": "GM BABY FUCK ALL THE HATERRRRRS\n\n(This excitement is just for breakeven 😂)", "sentiment": 1, "ticker": "GM"}, "gtlmy14": {"body": "ASO a good buy? 👍 or 👎", "sentiment": 0, "ticker": "ASO"}, "gtlmyx2": {"body": "anyone in on NIO calls for 44.5 on april 16th? a good buy or sell?", "sentiment": 0, "ticker": "NIO"}, "gtlmzsv": {"body": "If you're not getting on UWMC June and August calls WHAT ARE YOU DOING ???", "sentiment": 1, "ticker": "UWMC"}, "gtlmzxh": {"body": "RMO for the win", "sentiment": 1, "ticker": "RMO"}, "gtln2p2": {"body": "750 TSLA weeklies what’s the worst that could happen", "sentiment": 1, "ticker": "TSLA"}, "gtln49v": {"body": "TSLA pleas go uppies for power hour", "sentiment": 0, "ticker": "TSLA"}, "gtln4j2": {"body": "TSLA looking like it might fuck around and close above $700 and give me hope to take away later in the week.", "sentiment": 1, "ticker": "TSLA"}, "gtln5s4": {"body": "VIAC 3 $37 puts for 4/16 at 0.21", "sentiment": -1, "ticker": "VIAC"}, "gtln664": {"body": "RIDE to the moon?", "sentiment": 0, "ticker": "RIDE"}, "gtln6ua": {"body": "So BUY MORE RMO??", "sentiment": 1, "ticker": "RMO"}, "gtln9d4": {"body": "If you think you and other reddit traders are in control of this stock you're woefully mistaken.  Today's volume is only 5 million shares and that amounts to almost a billion dollars worth or shares.  I'm sorry to break it to you but GME is run by big dick-swinging fund managers who are plenty happy to take your money and leave you holding the bag.", "sentiment": -1, "ticker": "GME"}, "gtlnc7v": {"body": "Holding .. and purchased a few more shares today. Let’s go GME 🚀 🚀 🚀", "sentiment": 1, "ticker": "GME"}, "gtlngqf": {"body": "Why does TSLA hate 700", "sentiment": -1, "ticker": "TSLA"}, "gtlnhqq": {"body": "Wake up, check GME -slide resignation letter back in drawer, get ready to go to work", "sentiment": -1, "ticker": "GME"}, "gtlnivp": {"body": "Wait, I'm seeing green for GOEV? I think I need to go get my eyes checked...", "sentiment": 1, "ticker": "GOEV"}, "gtlnk8f": {"body": "Puts on RMO or not yet?", "sentiment": 0, "ticker": "RMO"}, "gtlnln9": {"body": "RIDE is back, let’s go", "sentiment": 1, "ticker": "RIDE"}, "gtlnm8l": {"body": "Just had a look at the NVAX options... What's up with the insane prices? $180 strike for July $39.55...that is huge!", "sentiment": 1, "ticker": "NVAX"}, "gtlnn0f": {"body": "SPY looking constipated", "sentiment": -1, "ticker": "SPY"}, "gtlnn5c": {"body": "whats happening with ASO eek", "sentiment": -1, "ticker": "ASO"}, "gtlnn5x": {"body": "Been calling BABA 235 all day. Keep the downvotes coming! We need a little more fuel for the rocket 🚀🚀🚀", "sentiment": 1, "ticker": "BABA"}, "gtlnnae": {"body": "Wow BA stop being a bitch and just go up unless you want to catch these hands ✋", "sentiment": 0, "ticker": "BA"}, "gtlnqm8": {"body": "That volume on ZOM looking pretty gooog", "sentiment": 1, "ticker": "ZOM"}, "gtlnqyh": {"body": "PLTR needs to know what?  As in their senior management needs to know this? LOL.  This is stupidest thing I've ever read.  You think they give a flying fuck what YouTube gurus are doing, and what it might be doing to their stock price?  They're focusing on growing their business.........not what a bunch of actual idiots who know absolutely nothing are doing to their stock price", "sentiment": 0, "ticker": "PLTR"}, "gtlnr89": {"body": "LETS GO 🚀🍦🐸\n\n\n***GME GME GME GME GME***", "sentiment": 1, "ticker": "GME"}, "gtlnrdk": {"body": "Fuck you mother fuckers. Saying CHPT was a bad investment now I'm 10,000 in the green. Fucking morons", "sentiment": 1, "ticker": "CHPT"}, "gtlns7u": {"body": "SPY chasin', free-basin', killin' every village\n\nI drink, and rob, and rhyme, and pillage\n\nSPY 4/20 420c", "sentiment": 1, "ticker": "SPY"}, "gtlnt6i": {"body": "$ACB will lead the pack. Cannabis stocks are on the verge of a major rebound. Shorts are better cover soon....", "sentiment": 1, "ticker": "ACB"}, "gtlnvwn": {"body": "All my shit is blown up except KTOS which is the only thing in my account that’s actually green 😳", "sentiment": 1, "ticker": "KTOS"}, "gtlnwfy": {"body": "It wasn't me, but I was also convinced on UWMC. I mean for God's sake this company just prints money.", "sentiment": 2, "ticker": "UWMC"}, "gtlo2q8": {"body": "That's how you know you're right.  \n\n\nAlso I'm 100% all in on CHPT on my 401k atm.", "sentiment": 1, "ticker": "CHPT"}, "gtlo43r": {"body": "PLTR to $42 by end of April", "sentiment": 1, "ticker": "PLTR"}, "gtlo4c5": {"body": "Fuck I just bought ES and RMO puts and see you guys are doing the same shit :/ I’m so fucked", "sentiment": -1, "ticker": "RMO"}, "gtlo5pd": {"body": "I really just bought RMO puts fml", "sentiment": 1, "ticker": "RMO"}, "gtlo6nd": {"body": "Do I regret buying TSLA $400 PUTS 5/21 this morning? \n\n\"No it's the market who's wrong\"", "sentiment": 1, "ticker": "TSLA"}, "gtlo7e0": {"body": "VIAC $50 EOW", "sentiment": 1, "ticker": "VIAC"}, "gtloa9j": {"body": "no way. i got into RIDE yesterday and it’s up 8% on the day. this is my first decent winning play in forever. time to make my money back slowly but surely lol. NO MORE GUH", "sentiment": 1, "ticker": "RIDE"}, "gtloaxw": {"body": "SPY is not letting up! Looks like another Green green day for SPY", "sentiment": 1, "ticker": "SPY"}, "gtlobdn": {"body": "What happened to $MT? I can’t figure out why it was pulled from Robinhood", "sentiment": -1, "ticker": "MT"}, "gtlobzw": {"body": "RMO has 131M volume, looking bullish, can we send it to the moon?", "sentiment": 1, "ticker": "RMO"}, "gtlocg7": {"body": "Get outta here with that ape strong together, diamond hand bullshit. The cult is in the GME thread, hence why they're separated.", "sentiment": -1, "ticker": "GME"}, "gtlochw": {"body": "Uhhhh.... guys I thought we all agreed RMO puts we’re gonna print", "sentiment": 1, "ticker": "RMO"}, "gtlod20": {"body": "It's been struggling to get above $31 so it wants to, but every time it gets a bit above $31 it gets slapped down again.\n\nIf you zoom out on ASO it has dips like this relatively often before it continues on chugging like the dips never happened.", "sentiment": 1, "ticker": "ASO"}, "gtloe9e": {"body": "Bro you're bound to make money long. RMO always falls", "sentiment": -1, "ticker": "RMO"}, "gtlofu9": {"body": "I’ve trippled down on BB at this point. But at sub $10 levels, it’s just too attractive.", "sentiment": 1, "ticker": "BB"}, "gtlogr8": {"body": "I feel bad for people that are not buying VIAC shares for cheap right now. Short squeeze soon", "sentiment": 1, "ticker": "VIAC"}, "gtlogw7": {"body": "Any PLTR gang want to explain the appeal to me? Seems like a stock that doesn't go anywhere even on good news. It's also seemingly not super volatile, which is the norm for WSB stocks.", "sentiment": -1, "ticker": "PLTR"}, "gtloh2s": {"body": "Yea I left the GME circus about two weeks ago since it started going sideways and the FOMO billionaires moved on to other things. HF's found creative ways to hold their positions and pay no interest so really, GME is not going anywhere. If anything, it's 'old news' til it hits $400 and Elon Musk buys.", "sentiment": -1, "ticker": "GME"}, "gtlohi5": {"body": "BB didn’t feel comfortable in the green yesterday.  The unfamiliar is scary I get it", "sentiment": -1, "ticker": "BB"}, "gtloicv": {"body": "guys ASO is literally $30. just buy a share and help out your fellow primates, don't forget we're all on the same team", "sentiment": 1, "ticker": "ASO"}, "gtlomrc": {"body": "I also rode the RIDE w/ calls from yesterday. Make sure to take profit :)", "sentiment": 1, "ticker": "RIDE"}, "gtloodi": {"body": "VIAC just slicing back through levels. Dick", "sentiment": 1, "ticker": "VIAC"}, "gtloprg": {"body": "RMO calls overnight like a crazy person", "sentiment": 1, "ticker": "RMO"}, "gtlopuq": {"body": "Mad respect to anyone who yolod on $RIDE today based completely on that one guys dd yesterday.", "sentiment": 1, "ticker": "RIDE"}, "gtloqmg": {"body": "Seriously.. youre betting against the SPY  right now? it's blasting!", "sentiment": 2, "ticker": "SPY"}, "gtloqnv": {"body": "GM @ $70 is just over the horizon. PE @ $62.50 is only 14. You'll be swimming in tendies soon enough.", "sentiment": 1, "ticker": "GM"}, "gtlorfu": {"body": "Holding QQQ puts into tomorrow", "sentiment": -1, "ticker": "QQQ"}, "gtlowuo": {"body": "Damn MSFT you’re supposed to go up boomer not down", "sentiment": -1, "ticker": "MSFT"}, "gtlp7vm": {"body": "Just buy $SPOT.", "sentiment": 1, "ticker": "SPOT"}, "gtlp9n7": {"body": "Late to the game but seeing PLTR have a day made it seem like a good time for me to dip my toe in the water.", "sentiment": 1, "ticker": "PLTR"}, "gtlpa4o": {"body": "Nobody here likes you GME bag holding chimps anymore and you have been quarantined in this mega thread like a dog. Hahahaha BUMS.", "sentiment": -1, "ticker": "GME"}}